# Pandas

In [2]:
#Pandas: it is a open source library that is used for handle data manipulation.

In [4]:
#installation of pandas
!pip install pandas

Requirement already satisfied: pandas in c:\users\mahak\anaconda3\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\mahak\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\mahak\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\mahak\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\mahak\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\mahak\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [6]:
import pandas as pd

In [8]:
#Data structure of pandas:
#1. Series
#2.DataFrame

In [10]:
#(1).Series:---->it is one dimensionalarray and it returns only values not column name.

In [12]:
a=pd.Series([1,23,34,67])
a

0     1
1    23
2    34
3    67
dtype: int64

In [14]:
type(a)

pandas.core.series.Series

In [16]:
#(2.)DataFrame:----->it is multidimensional array and returns values with column name.

In [22]:
a={
    "Emp_Id":[1,2,3,4,5],
    "Name":['Sam','Raj','Aniket','Pallavi','Rahul'],
    "Department":['IT','Sales','IT','IT','IT'],
    "Working_Hours":[8,8,9,7,8],
    "Salary":[25000,27000,31000,36000,50000]
}

In [24]:
type(a)

dict

In [26]:
df = pd.DataFrame(a)
df

   Emp_Id     Name Department  Working_Hours  Salary
0       1      Sam         IT              8   25000
1       2      Raj      Sales              8   27000
2       3   Aniket         IT              9   31000
3       4  Pallavi         IT              7   36000
4       5    Rahul         IT              8   50000

# How can we import or export our dataframe?

In [ ]:
#steps for export from jupyter
'''1. create a folder
2.copy the folder location
3.paste it into df.to_csv("paste_folder_location//file_name.csv)

steps for import from a folder in jupyter notebook
pd.read_csv("paste_folder_location//file_name.csv")

steps for import data in google colab
create new notebook-->click on files that is present in left side---->click on upload session
--->select the file ---->click open

In [36]:
df.to_csv("C:\\Users\\mahak\\Desktop\\adv_python\\Emp_Info.csv",index=False)

In [40]:
df2=pd.read_csv("C:\\Users\\mahak\\Downloads\\sales_data.csv")
df2

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,295665,Macbook Pro Laptop,1,1700,12/30/19 00:01,"136 Church St, New York City, NY 10001"
1,295666,LG Washing Machine,1,600.0,12/29/19 07:03,"562 2nd St, New York City, NY 10001"
2,295667,USB-C Charging Cable,1,11.95,12/12/19 18:21,"277 Main St, New York City, NY 10001"
3,295668,27in FHD Monitor,1,149.99,12/22/19 15:13,"410 6th St, San Francisco, CA 94016"
4,295669,USB-C Charging Cable,1,11.95,12/18/19 12:38,"43 Hill St, Atlanta, GA 30301"
...,...,...,...,...,...,...
186845,150497,20in Monitor,1,109.99,01/26/19 19:09,"95 8th St, Dallas, TX 75001"
186846,150498,27in FHD Monitor,1,149.99,01/10/19 22:58,"403 7th St, San Francisco, CA 94016"
186847,150499,ThinkPad Laptop,1,999.99,01/21/19 14:31,"214 Main St, Portland, OR 97035"
186848,150500,AAA Batteries (4-pack),2,2.99,01/15/19 14:21,"810 2nd St, Los Angeles, CA 90001"
186849,150501,Google Phone,1,600,01/13/19 16:43,"428 Cedar St, Boston, MA 02215"

In [44]:
df.to_excel("C:\\Users\\mahak\\Desktop\\adv_python\\Emp_Detail.xlsx",index=False)

In [1]:
a={
    "id": range(1, 11),
    "name": ["Alice", "Bob", "Charlie", "David", "Eva", "Frank", "Grace", "Hannah", "Ivy", "Jack"],
    "roll_no": [101, 102, 103, 104, 105, 106, 107, 108, 109, 110],
    "section": ["A", "B", "C", "A", "B", "C", "A", "B", "C", "A"],
    "batch": ["2021", "2021", "2022", "2022", "2023", "2023", "2021", "2022", "2023", "2021"],
    "domain": ["CS", "IT", "ECE", "CS", "IT", "ECE", "CS", "IT", "ECE", "CS"]
}

In [5]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\mahak\anaconda3\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\mahak\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\mahak\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\mahak\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\mahak\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\mahak\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [7]:
import pandas as pd

In [11]:
df=pd.DataFrame(a)
df

   id     name  roll_no section batch domain
0   1    Alice      101       A  2021     CS
1   2      Bob      102       B  2021     IT
2   3  Charlie      103       C  2022    ECE
3   4    David      104       A  2022     CS
4   5      Eva      105       B  2023     IT
5   6    Frank      106       C  2023    ECE
6   7    Grace      107       A  2021     CS
7   8   Hannah      108       B  2022     IT
8   9      Ivy      109       C  2023    ECE
9  10     Jack      110       A  2021     CS

In [19]:
df.to_csv("C:\\Users\\mahak\\Desktop\\adv_python\\stud_details.csv",index=False)

In [21]:
df2=pd.read_csv("C:\\Users\\mahak\\Desktop\\adv_python\\stud_details.csv")
df2

   id     name  roll_no section  batch domain
0   1    Alice      101       A   2021     CS
1   2      Bob      102       B   2021     IT
2   3  Charlie      103       C   2022    ECE
3   4    David      104       A   2022     CS
4   5      Eva      105       B   2023     IT
5   6    Frank      106       C   2023    ECE
6   7    Grace      107       A   2021     CS
7   8   Hannah      108       B   2022     IT
8   9      Ivy      109       C   2023    ECE
9  10     Jack      110       A   2021     CS